Revit 2026 API

# DuctFittingAndAccessoryData Properties

---

The DuctFittingAndAccessoryData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Density | The air density for the duct fitting or duct accessory, Units: kg/ft^3. |
|  | DynamicViscosity | The dynamic viscosity of air for the duct fitting or duct accessory, Units: (kg/(ft·s)). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Origin | The origin position of the duct fitting or duct accessory. |
|  | PartType | The part type of the duct fitting or duct accessory. |
|  | ServerGUID | The GUID of the duct fitting or duct accessory. |
|  | SystemClassification | The system classification of the duct fitting or duct accessory. |

#### Reference

DuctFittingAndAccessoryData Class

Autodesk.Revit.DB.Mechanical Namespace